# **main.py**: Он будет запускаться и запрашивать информацию от пользователя.

# ? dice

? True:
    # Ввод числа граней кубика
    num_sides

    # Валидация введенного числа
    if not num_s+метод проверки на число():
        print(?)
#         продолжи

    # Обращение к функции roll_dice и вывод результата
#     roll_result = dice.... :)
    print("You rolled a " + str(roll_result) + "!")

    # Проверка на продолжение игры
    play_again = input("Roll again? (y/n): ")
    if ввод в нижнем регистре != "y":
#         перерыв
